<div class="tab-list">

    <div class="tab-list__titles">
        <ul>
            <li id="tab-title-1">Twentyone Development</li>
            <li id="tab-title-2">Cazarina Interiors</li>
            <li id="tab-title-3">QBRIX</li>
            <li id="tab-title-4" class="active">Dnestrenergo</li>
        </ul>
    </div>

    <div class="tab-list__content">
        <ul>

            <ul class="tab-list__content">
                <li id="tab-content-1" class="tab-content-item">
                    <h3>Full stack developer <span>Twentyone Development</span></h3>
                    <div class="tab-list__content__range">November 2022 - Present</div>
                    <p>Опыт создания структуры и стилей веб-страниц с использованием HTML, CSS и SCSS, с применением методологии БЭМ. Разработка кастомных тем и плагинов для WordPress на PHP. Использование JavaScript, jQuery и AJAX для создания интерактивных элементов. Разработка и настройка интернет-магазинов на базе WooCommerce. Управление версиями с использованием Git и хостинг проектов на GitHub. Настройка серверов LAMP и контейнеризация приложений с использованием Docker. Создание адаптивных веб-страниц. Взаимодействие с внешними сервисами через API.</p>
                    <p>Разработка пользовательских интерфейсов и взаимодействие с бэкендом. Оптимизация производительности и улучшение доступности веб-приложений. Работа в команде и управление проектами с использованием Agile методологий. Поддержка и доработка существующих систем. Тестирование и отладка кода для обеспечения высокого качества продукта.</p>
                </li>

                <li id="tab-content-2" class="tab-content-item">
                    <h3>Chef developer <span>Cazarina Interiors</span></h3>
                    <div class="tab-list__content__range">June - December 2023</div>
                    <p>Разработка и интеграция функциональных модулей для управления веб-сайтами и приложениями. Создание кастомных тем и плагинов для WordPress с учетом требований заказчика. Использование PHP для обработки данных и взаимодействия с базами данных. Оптимизация производительности и безопасности веб-приложений. Интеграция сторонних API и сервисов для расширения функциональности.</p>
                    <p>Адаптивная верстка и создание пользовательских интерфейсов. Разработка и поддержка клиентских приложений на основе JavaScript и jQuery. Управление версиями кода с использованием Git и GitHub. Настройка и администрирование серверов с использованием LAMP стека. Отладка и тестирование функционала для обеспечения соответствия требованиям заказчика.</p>
                </li>

                <li id="tab-content-3" class="tab-content-item">
                    <h3>Lead Engineer <span>QBRIX</span></h3>
                    <div class="tab-list__content__range">July - December 2017</div>
                    <p>Руководство и координация работы команды разработчиков. Разработка архитектуры и дизайна программных решений. Создание высоконагруженных систем с использованием современных технологий. Управление проектами с помощью Agile методологий. Анализ и оптимизация производительности систем. Внедрение и настройка мониторинга для контроля работы приложений.</p>
                    <p>Разработка и интеграция систем автоматизации бизнес-процессов. Оптимизация и поддержка баз данных. Внедрение новых технологий для улучшения работы веб-приложений. Поддержка и развитие существующих проектов. Тестирование и отладка функционала для обеспечения высокого качества продукта.</p>
                    <p>Консультирование команды по вопросам разработки и реализации проектных решений. Взаимодействие с клиентами для обсуждения требований и уточнения деталей проекта. Управление изменениями и контроль за выполнением сроков и бюджета проекта.</p>
                </li>

                <li id="tab-content-4" class="tab-content-item active">
                    <h3>Software Developer <span>Dnestrenergo</span></h3>
                    <div class="tab-list__content__range">November 2016 - March 2022</div>
                    <p>Разработка и настройка пользовательских интерфейсов. Интеграция сторонних API для расширения функциональности системы.</p>
                    <p>Написание простого функционала на PHP и C++. Администрирование компьютерной и телекоммуникационных сетей. Обслуживание компьютерной техники. Обслуживание и развертывание серверов на ОС Linux и Win Server. Обслуживание и расширение системы управления энергетическим оборудованием подстанций, настройка автоматики</p>
                    <p>Поддержка и сопровождение существующих систем. Развитие и внедрение новых технологий для улучшения работы приложений и системы в целом.</p>
                    <p>Консультирование пользователей и команды разработки по вопросам функциональности и технических решений. Адаптация и интеграция новых функций и возможностей в существующую систему.</p>
                </li>
            </ul>

        </ul>
    </div>

</div>
